In [19]:
import pandas as pd
citi_bike = pd.read_csv('data\citibike-tripdata.csv', sep=',')
citi_bike_df = citi_bike.copy()
citi_bike_df.head()

,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
0,2018-09-01 00:00:05.2690,2018-09-01 00:27:20.6340,252.0,MacDougal St & Washington Sq,40.732264,-73.998522,366.0,Clinton Ave & Myrtle Ave,40.693261,-73.968896,25577,Subscriber,1980,1
1,2018-09-01 00:00:11.2810,2018-09-01 00:02:23.4810,314.0,Cadman Plaza West & Montague St,40.693830,-73.990539,3242.0,Schermerhorn St & Court St,40.691029,-73.991834,34377,Subscriber,1969,0
2,2018-09-01 00:00:20.6490,2018-09-01 00:55:58.5470,3142.0,1 Ave & E 62 St,40.761227,-73.960940,3384.0,Smith St & 3 St,40.678724,-73.995991,30496,Subscriber,1975,1
3,2018-09-01 00:00:21.7460,2018-09-01 00:07:38.5830,308.0,St James Pl & Oliver St,40.713079,-73.998512,3690.0,Park Pl & Church St,40.713342,-74.009355,28866,Subscriber,1984,2
4,2018-09-01 00:00:27.3150,2018-09-01 02:21:25.3080,345.0,W 13 St & 6 Ave,40.736494,-73.997044,380.0,W 4 St & 7 Ave S,40.734011,-74.002939,20943,Customer,1994,1

In [20]:
citi_bike_df['start station id'].isnull().sum()

169

In [21]:
citi_bike_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 14 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   starttime                300000 non-null  object
 1   stoptime                 300000 non-null  object
 2   start station id         299831 non-null  float64
 3   start station name       299831 non-null  object
 4   start station latitude   300000 non-null  float64
 5   start station longitude  300000 non-null  float64
 6   end station id           299831 non-null  float64
 7   end station name         299831 non-null  object
 8   end station latitude     300000 non-null  float64
 9   end station longitude    300000 non-null  float64
 10  bikeid                   300000 non-null  int64
 11  usertype                 300000 non-null  object
 12  birth year               300000 non-null  int64
 13  gender                   300000 non-null  int64
dtypes: float64(6), int64(3), object(5)
memory usage: 32.0+ MB

In [22]:
citi_bike_df['start station id'].mode()

0    281.0
Name: start station id, dtype: float64

In [23]:
citi_bike['bikeid'].mode()

0    33887
Name: bikeid, dtype: int64

In [24]:
citi_bike['usertype'].value_counts(normalize=True)

usertype
Subscriber    0.774007
Customer      0.225993
Name: proportion, dtype: float64

In [25]:
citi_bike[citi_bike['gender'] == 1]['gender'].count()

183582

In [26]:
display(citi_bike_df['start station id'].nunique())
display(citi_bike_df['end station id'].nunique())

759

765

In [27]:
display(citi_bike_df['birth year'].max())
display(citi_bike_df['starttime'].head())

2002

0    2018-09-01 00:00:05.2690
1    2018-09-01 00:00:11.2810
2    2018-09-01 00:00:20.6490
3    2018-09-01 00:00:21.7460
4    2018-09-01 00:00:27.3150
Name: starttime, dtype: object

In [28]:
citi_bike_df['start station name'].value_counts()

start station name
Grand Army Plaza & Central Park S    1928
Central Park S & 6 Ave               1909
Pershing Square North                1873
12 Ave & W 40 St                     1845
West St & Chambers St                1835
                                     ...
NYCBS Depot - GOW                      15
Franklin Ave & Empire Blvd             11
Railroad Ave & Kay Ave                  9
47 Ave & Skillman Ave                   7
Eastern Pkwy & Washington Ave           6
Name: count, Length: 759, dtype: int64

In [29]:
citi_bike_df['end station name'].value_counts()

end station name
West St & Chambers St          1963
12 Ave & W 40 St               1909
Pershing Square North          1850
Central Park S & 6 Ave         1828
E 17 St & Broadway             1804
                               ...
Exchange Place                    3
Union St                          1
Warren St                         1
Montrose Ave & Bushwick Ave       1
Liberty Light Rail                1
Name: count, Length: 765, dtype: int64

In [31]:
citi_bike_df = citi_bike_df.drop(['start station id', 'end station id'], axis=1)

In [32]:
citi_bike_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 12 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   starttime                300000 non-null  object
 1   stoptime                 300000 non-null  object
 2   start station name       299831 non-null  object
 3   start station latitude   300000 non-null  float64
 4   start station longitude  300000 non-null  float64
 5   end station name         299831 non-null  object
 6   end station latitude     300000 non-null  float64
 7   end station longitude    300000 non-null  float64
 8   bikeid                   300000 non-null  int64
 9   usertype                 300000 non-null  object
 10  birth year               300000 non-null  int64
 11  gender                   300000 non-null  int64
dtypes: float64(4), int64(3), object(5)
memory usage: 27.5+ MB

In [36]:
citi_bike_df['age'] = citi_bike_df['birth year'].apply(lambda x: 2018 - x)
citi_bike_df = citi_bike_df.drop('birth year', axis=1)

In [39]:
citi_bike_df[citi_bike_df['age'] > 60]['age'].count()

11837

In [41]:
citi_bike_df[['stoptime', 'starttime']]

                        stoptime                 starttime
0       2018-09-01 00:27:20.6340  2018-09-01 00:00:05.2690
1       2018-09-01 00:02:23.4810  2018-09-01 00:00:11.2810
2       2018-09-01 00:55:58.5470  2018-09-01 00:00:20.6490
3       2018-09-01 00:07:38.5830  2018-09-01 00:00:21.7460
4       2018-09-01 02:21:25.3080  2018-09-01 00:00:27.3150
...                          ...                       ...
299995  2018-09-05 19:15:51.4940  2018-09-05 19:08:27.8460
299996  2018-09-05 19:20:01.5080  2018-09-05 19:08:28.3700
299997  2018-09-05 19:13:40.5060  2018-09-05 19:08:27.5090
299998  2018-09-05 20:04:29.3220  2018-09-05 19:08:29.2300
299999  2018-09-05 19:12:14.7620  2018-09-05 19:08:29.7110

[300000 rows x 2 columns]

In [43]:
citi_bike_df['stoptime'] = pd.to_datetime(citi_bike_df['stoptime'])
citi_bike_df['starttime'] = pd.to_datetime(citi_bike_df['starttime'])
citi_bike_df['trip duration'] = citi_bike_df['stoptime'] - citi_bike_df['starttime']
citi_bike_df['trip duration']

0        0 days 00:27:15.365000
1        0 days 00:02:12.200000
2        0 days 00:55:37.898000
3        0 days 00:07:16.837000
4        0 days 02:20:57.993000
                  ...
299995   0 days 00:07:23.648000
299996   0 days 00:11:33.138000
299997   0 days 00:05:12.997000
299998   0 days 00:56:00.092000
299999   0 days 00:03:45.051000
Name: trip duration, Length: 300000, dtype: timedelta64[ns]

In [51]:
citi_bike_df.iloc[3]['trip duration']

Timedelta('0 days 00:07:16.837000')

In [54]:
weekend_df = citi_bike_df['starttime'].dt.day_of_week
citi_bike_df['weekend'] = weekend_df.apply(lambda x: 1 if x in (5, 6) else 0)
citi_bike_df['weekend']

0         1
1         1
2         1
3         1
4         1
         ..
299995    0
299996    0
299997    0
299998    0
299999    0
Name: weekend, Length: 300000, dtype: int64

In [55]:
citi_bike_df[citi_bike_df['weekend'] == 1]['weekend']. count()

115135

In [66]:
def hour_to_time_of_day(hour):
    if hour in range(7): return 'night'
    elif hour in range(7, 13): return 'morning'
    elif hour in range(13, 19): return 'day'
    else: return 'evening'
    
hour_df = citi_bike_df['starttime'].dt.hour

citi_bike_df['time_of_day'] = hour_df.apply(hour_to_time_of_day)
citi_bike_df[['time_of_day', 'starttime']]

       time_of_day               starttime
0            night 2018-09-01 00:00:05.269
1            night 2018-09-01 00:00:11.281
2            night 2018-09-01 00:00:20.649
3            night 2018-09-01 00:00:21.746
4            night 2018-09-01 00:00:27.315
...            ...                     ...
299995     evening 2018-09-05 19:08:27.846
299996     evening 2018-09-05 19:08:28.370
299997     evening 2018-09-05 19:08:27.509
299998     evening 2018-09-05 19:08:29.230
299999     evening 2018-09-05 19:08:29.711

[300000 rows x 2 columns]

In [67]:
day_trips = citi_bike_df[citi_bike_df['time_of_day'] == 'day']['time_of_day'].count()
night_trips = citi_bike_df[citi_bike_df['time_of_day'] == 'night']['time_of_day'].count()
round(day_trips / night_trips)

9